Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: Could not find tags. Please try again later.
cy: Nid oedd modd dod o hyd i dagiau. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not find users. Please try again later.
cy: Nid oedd modd dod o hyd i ddefnyddwyr. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not find reactions. Please try again later.
cy: Nid oedd modd dod o hyd i ymatebion. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load users. Please try again later.
cy: Nid oedd modd llwytho defnyddwyr. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load your feed right now.
cy: Nid oedd modd llwytho eich crynodeb ar hyn o bryd.

source: Could not load your friends list. Please try again later.
cy: Nid oedd modd llwytho eich rhestr o ffrindiau. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load posts. Please try again later.
cy: Nid oedd modd llwytho postiadau. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load tags. Please try again later.
cy: Nid oedd modd llwytho tagiau. Rhowch gynnig arall arni yn nes ymlaen.

source: The shopping cart could not be loaded. Try again?
cy: Nid oedd modd llwytho'r cert siopa. Trio eto?

source: The image could not be uploaded.
cy: Nid oedd modd llwytho'r ddelwedd.

source: Could not load this feed right now.
cy: Nid oedd modd llwytho'r grynodeb hon ar hyn o bryd.

source: The homescreen could not be loaded. Try again?
cy: Nid oedd modd llwytho'r hafan. Trio eto?

source: Could not load notifications. Please try again later.
cy: Nid oedd modd llwytho'r hysbysiadau. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load credentials. Please try again later.
cy: Nid oedd modd llwytho'r manylion adnabod. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not load this profile
cy: Nid oedd modd llwytho'r proffil hwn

source: Could not login. Please try again later.
cy: Nid oedd modd mewngofnodi. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not fetch posts. Please try again later.
cy: Nid oedd modd nôl y postiadau. Rhowch gynnig arall arni yn nes ymlaen.

source: Could not determine your current location.
cy: Nid oedd modd pennu eich lleoliad cyfredol.

source: Could not post. Please try again later.
cy: Nid oedd modd postio. Rhowch gynnig arall arni yn nes ymlaen.

source: Your photo could not be posted. Try again?
cy: Nid oedd modd postio'ch llun. Ceisio eto?

source: Passcodes did not match. Try again.
cy: Nid oedd y codau cyfrin yn cyfateb. Trïwch eto.

source: Export was not successful
cy: Nid oedd yr allgludo'n llwyddiannus

source: We couldn't find anyone. Tap to refresh.
cy: Nid oeddem yn gallu dod o hyd i unrhyw un. Tapiwch i adnewyddu.

source: We couldn't sign you up. Try a different username?
cy: Nid oeddem yn gallu'ch cofrestru. Trio enw defnyddiwr arall?

source: No such app installed
cy: Nid oes ap o'r fath wedi'i gosod

source: Your %@ doesn't have any Apps that can open this.
cy: Nid oes gan eich %@ unrhyw Apiau sy'n gallu agor hwn.

source: You have existing data on this device, are you sure you wish to replace it with this backup?
cy: Nid oes gennych unrhyw ddata presennol ar y ddyfais hon, ydych chi'n siŵr eich bod eisiau ei ddisodli gyda'r copi wrth gefn hwn?

source: You have no blocked users.
cy: Nid oes gennych unrhyw ddefnyddwyr wedi'u rhwystro.

source: File URL not reachable.
cy: Nid oes modd cyrraedd ffeil yr URL.

source: Can't connect to server
cy: Nid oes modd cysylltu â'r gweinydd

source: You are not signed in to Facebook on this device
cy: Nid wyt ti wedi mewngofnodi i Facebook ar y ddyfais yma

source: You are not signed in to Twitter on this device
cy: Nid wyt ti wedi mewngofnodi i Twitter ar y ddyfais yma

source: You haven't granted permission to [APPNAME] to access your Calendar. You can change that in Settings/Privacy
cy: Nid ydych wedi rhoi caniatâd i TimeTrack gael mynediad at eich calendr. Gallwch newid hynny yn Gosodiadau/Preifatrwydd

source: Nor do we extract any personal data from a user's device for upload to a server.
cy: Nid ydym chwaith yn echdynnu unrhyw ddata personol o ddyfais defnyddiwr i lwytho i weinydd.

source: We do not collect any personally identifiable information from our users, from either this website or any of our apps.
cy: Nid ydym yn casglu unrhyw wybodaeth bersonol y gellir ei ddefnyddio i adnabod person oddi wrth ein defnyddwyr, naill ai o'r wefan hon neu unrhyw un o'n apiau.

source: We don’t store your passwords and will never post anything without your permission.
cy: Nid ydym yn storio'ch cyfrineiriau a byddwn byth yn postio unrhyw beth heb eich caniatâd.

source: %@ does not have any availability blocks set up.
cy: Nid yw %@ wedi gosod unrhyw flociau argaeledd.

source: Events are not allowed to overlap other events.
cy: Nid yw digwyddiadau yn cael gorgyffwrdd digwyddiadau eraill.

source: Your device doesn't support SMS!
cy: Nid yw eich dyfais yn cefnogi negeseuon testun!

source: Traffic is not available in every country.
cy: Nid yw traffig ar gael ym mhob gwlad.

source: Your code doesn't exist or has already been used. Please try another one
cy: Nid yw'ch cod yn bodoli neu mae eisoes wedi cael ei ddefnyddio. Rhowch gynnig ar un arall

source: Your device is unable to send messages like this
cy: Nid yw'ch dyfais yn gallu anfon negeseuon fel hyn

source: NOT STORE
cy: NID YW'N STORIO

source: Modifications aren't in sync. Choose which version to keep.
cy: Nid yw'r addasiadau yn gyson. Dewiswch pa fersiwn i gadw.

source: Travel time to %@ is currently unavailable
cy: Nid yw'r amser teithio i %@ ar gael ar hyn o bryd

source: Your selected navigation app doesn't support transit. Would you like to launch Apple Maps instead?
cy: Nid yw'r ap llywio ddewisoch chi yn cefnogi tramwy. Hoffech chi lansio Apple Maps yn lle hynny?

source: Camera currently unavailable
cy: Nid yw'r camera ar gael ar hyn o bryd

source: Verify Code does not match. Please try again.
cy: Nid yw'r Cod Dilysu yn cyd-fynd. Rhowch gynnig arall arni.

source: The passwords don't match.
cy: Nid yw'r cyfrineiriau nodoch chi yn cyd-fynd.

source: This device does not automatically track your sleeping hours. You can enter this into the Health app manually, or using a compatible sleep tracking app.
cy: Nid yw'r ddyfais hon yn olrhain eich oriau cysgu yn awtomatig. Gallwch nodi hyn yn yr ap Iechyd eich hun, neu gan ddefnyddio ap cysgu cydnaws.

source: This device does not automatically track your sleeping hours. You can enter this into the Health app manually.
cy: Nid yw'r ddyfais yn olrhain eich oriau cysgu yn awtomatig. Gallwch nodi hyn yn yr ap Iechyd eich hun.

source: This device does not automatically track your cycling distance. You can enter this into the Health app manually.
cy: Nid yw'r ddyfais yn olrhain eich pellter seiclo yn awtomatig. Gallwch nodi hyn yn yr ap Iechyd eich hun.

source: Email does not exist
cy: Nid yw'r e-bost yn bodoli

source: Email is not valid
cy: Nid yw'r e-bost yn ddilys

source: Username is not valid
cy: Nid yw'r enw defnyddiwr yn ddilys

source: Screen name is not valid
cy: Nid yw'r enw sgrin yn ddilys

source: The video has not yet completed downloading. Please try again later.
cy: Nid yw'r fideo wedi gorffen lawrlwytho eto. Rhowch gynnig arall arni yn ddiweddarach.

source: Match hasn't started. Stay tuned for live stream.
cy: Nid yw'r gêm wedi cychwyn. Parhewch i wylio ar gyfer y ffrwd fyw.

source: Match hasn't started
cy: Nid yw'r gêm wedi dechrau

source: New and confirm password fields don't match
cy: Nid yw'r hen gyfrinair a'r cyfrinair newydd yn cyfateb

source: Message has not been sent. Discard it?
cy: Nid yw'r neges wedi cael ei hanfon. Cael gwared arni?

source: Feature not enabled for this demo.
cy: Nid yw'r nodwedd wedi'i alluogi ar gyfer yr enghraifft hon.

source: The phone number %s is not valid.
cy: Nid yw'r rhif ffôn %s yn ddilys.

source: Website is not valid
cy: Nid yw'r wefan yn ddilys

source: Country and phone number do not match
cy: Nid yw'r wlad a'r rhif ffôn yn cyfateb

source: Quantity
cy: Nifer

source: Quantity %@ is invalid
cy: Nifer %@ yn annilys

source: Default number of working hours. It is used for manual time entry
cy: Nifer diofyn o oriau gweithio. Caiff ei defnyddio ar gyfer cofnodi amser eich hun

source: Number of days per week
cy: Nifer o ddiwrnodau yr wythnos

source: Likes
cy: Nifer sydd wedi hoffi

source: Badge Count
cy: Nifer y Bathodynnau

source: No tables
cy: Nifer y byrddau

source: Number of events
cy: Nifer y digwyddiadau

source: Number of Days:
cy: Nifer y diwrnodau:

source: Duty Counts
cy: Nifer y Dyletswyddau

source: Number of Duties
cy: Nifer y Dyletswyddau

source: Number of recent friends
cy: Nifer y ffrindiau diweddar

source: Recent friends count
cy: Nifer y ffrindiau diweddar

source: Number of top friends
cy: Nifer y ffrindiau gorau

source: Number of Employees Needed
cy: Nifer y gweithwyr sydd eu hangen

source: No guests
cy: Nifer y gwesteion

source: Number of Assigned
cy: Nifer yr Aseiniadau

source: Number of subtasks
cy: Nifer yr is-dasgau

source: Number of Hours
cy: Nifer yr Oriau

source: Goal
cy: Nod

source: Daily goal
cy: Nod dyddiol

source: Linefeed character
cy: Nod Linefeed

source: Goals
cy: Nodau

source: Goals completed
cy: Nodau a gwblhawyd

source: Input Your Availability
cy: Nodi eich Argaeledd

source: Enter manually
cy: Nodi eich hun

source: Notes
cy: Nodiadau

source: Reminders
cy: Nodiadau atgoffa

source: Enter City or Zip Code
cy: Nodwch ddinas neu god post

source: Please enter a valid email
cy: Nodwch e-bost dilys

source: Enter the 4-digit code to complete your registration.
cy: Nodwch eich cod 4-digid i gwblhau cofrestru.

source: Enter your passcode
cy: Nodwch eich cod cyfrin

source: Enter your new passcode
cy: Nodwch eich cod cyfrin newydd

source: Enter your email address
cy: Nodwch eich cyfeiriad e-bost

source: Enter your email address and we’ll send you a new password
cy: Nodwch eich cyfeiriad e-bost ac fe anfonwn gyfrinair newydd atoch

source: Please enter your password
cy: Nodwch eich cyfrinair

source: Enter your current password
cy: Nodwch eich cyfrinair cyfredol

source: Please enter your email to continue
cy: Nodwch eich e-bost i barhau

source: Enter your email here and we will send you your password reset instructions.
cy: Nodwch eich ebost yma a byddwn yn anfon manylion atoch i ailosod eich cyfrinair.

source: Enter your username
cy: Nodwch eich enw defnyddiwr

source: Please enter your username or email
cy: Nodwch eich enw defnyddiwr neu ebost

source: Please enter your fullname
cy: Nodwch eich enw llawn

source: Enter your old passcode
cy: Nodwch eich hen god cyfrin

source: Enter your native language
cy: Nodwch eich mamiaith

source: Enter your age
cy: Nodwch eich oed

source: Enter a valid username, password and email.
cy: Nodwch enw defnyddiwr, cyfrinair ac e-bost dilys.

source: Please try a filter name you haven't used.
cy: Nodwch enw hidlydd nad ydych wedi'i defnyddio.

source: Enter a name,
cy: Nodwch enw,

source: Enter task title…
cy: Nodwch enw'r dasg…

source: Enter the event details - the start time is already entered, and can be adjusted if required.
cy: Nodwch fanylion y digwyddiad - mae'r amser cychwyn eisoes wedi'i nodi, a gellir ei addasu os oes angen.

source: Enter phone #
cy: Nodwch ffôn #

source: Enter a passcode
cy: Nodwch god cyfrin

source: Enter a different passcode. You cannot re-use the same passcode.
cy: Nodwch god cyfrin gwahanol. Ni allwch ddefnyddio'r un cod cyfrin.

source: Please enter a valid code
cy: Nodwch god dilys

source: Enter address
cy: Nodwch gyfeiriad

source: Please enter a valid email :)
cy: Nodwch gyfeiriad e-bost dilys :)

source: Enter a web address
cy: Nodwch gyfeiriad gwe

source: Enter a new password
cy: Nodwch gyfrinair newydd

source: Enter a phone number
cy: Nodwch rif ffôn

source: Please enter a phone number
cy: Nodwch rif ffôn

source: Please enter a valid phone number
cy: Nodwch rif ffôn dilys

source: Please enter a valid phone number or leave it empty
cy: Nodwch rif ffôn dilys neu gadewch y blwch yn wag

source: Enter the code that was sent to
cy: Nodwch y cod a anfonwyd at

source: Enter Passcode
cy: Nodwch y cod cyfrin

source: Enter message…
cy: Nodwch y neges…

source: Enter the e-mail you used to sign up.
cy: Nodwch yr e-bost ddefnyddioch chi i gofrestru.

source: Feature not available
cy: Nodwedd ddim ar gael

source: Feature Unavailable
cy: Nodwedd ddim ar gael

source: Feature not enabled for this demo
cy: Nodwedd heb ei alluogi ar gyfer yr arddangosiad hwn

source: FEATURES
cy: NODWEDDION

source: Note
cy: Nodyn

source: Reminder
cy: Nodyn atgoffa

source: Duplicate Reminder
cy: Nodyn atgoffa dyblyg

source: Daily reminder
cy: Nodyn atgoffa dyddiol

source: New Reminder
cy: Nodyn atgoffa newydd

source: Reminder: %@
cy: Nodyn atgoffa: %@

source: New note
cy: Nodyn newydd

source: Swim
cy: Nofio

source: Norway
cy: Norwy

source: Night
cy: Nos

source: Good evening sally.
cy: Noswaith dda Sali.

source: From
cy: O

source: of
cy: o

source: from %{LOCATION}
cy: o %{LOCATION}

source: From over 400 bloggers.
cy: O dros 400 blogiwr.

source: Within the Settings app:
cy: O fewn yr ap Gosodiadau:

source: Uh-oh, looks like we can't connect to the Internet!
cy: O na, ymddengys nad oes modd i ni gysylltu â'r rhyngrwyd!

source: Uh Oh!
cy: O na!

source: Uh oh…
cy: O na…

source: From: %@
cy: O: %@

source: From: %@ To: %@
cy: O: %@ I: %@

source: Ah.. sorry. We couldn't map that address.
cy: O… mae'n flin gennym. Nid oedd modd mapio'r cyfeiriad hwnnw.

source: around you.
cy: o'ch amgylch.

source: BEFORE
cy: O'R BLAEN

source: Make professional quality designs, illustrations and technical drawings on the move using your fingers at last!
cy: O'r diwedd gallwch wneud ddyluniadau, darluniau a lluniadau technegol o ansawdd broffesiynol mewn unrhyw le gan ddefnyddio'ch bysedd!

source: From library
cy: O'r llyfrgell

source: From the home screen, double press the Home button and swipe up on the [APPNAME] Pro screenshot.
cy: O'r sgrin hafan, pwyswch ddwywaith ar y botwm hafan a sweipiwch i fyny ar sgrinlun [APPNAME] Pro.

source: Fighting Mania
cy: Obsesiwn ymladd

source: Delay
cy: Oedi

source: Pause
cy: Oedi

source: Default pause
cy: Oedi diofyn

source: Minute interval for time picker / scroll wheel
cy: Oedi munud ar gyfer dewisydd amser / olwyn sgrolio

source: Departure delay
cy: Oedi wrth adael

source: Delayed departure
cy: Oedi yn yr amser gadael

source: age
cy: oedran

source: Lifetime
cy: Oes

source: Is there a desktop version of [APPNAME]?
cy: Oes fersiwn bwrdd gwaith o [APPNAME]?

source: Do you have any doubts about the assignment?
cy: Oes gennych chi unrhyw amheuon am yr aseiniad?

source: Is there something missing?
cy: Oes rhywbeth ar goll?

source: Is there anything you don't like?
cy: Oes yna unrhyw beth nad ydych yn ei hoffi?

source: Dark Ages
cy: Oesoedd Tywyll

source: Tools
cy: Offer

source: NEW POWERFOOL TOOLS AND WORKFLOW ENHANCEMENTS
cy: OFFER PWERUS NEWYDD A GWELLIANNAU I'R LLIF GWAITH

source: Manager Tools
cy: Offer Rheolwr

source: Awful
cy: Ofnadwy

source: Project Time Tracker
cy: Olrhain Amser Prosiect

source: Sleep Tracking
cy: Olrhain Cwsg

source: Cycle Distance Tracking
cy: Olrhain Pellter Seiclo

source: Options
cy: Opsiynau

source: Options and Settings
cy: Opsiynau a Gosodiadau

source: Other sending options
cy: Opsiynau anfon eraill

source: Display Options
cy: Opsiynau Arddangos

source: Product options
cy: Opsiynau cynnyrch

source: Orange
cy: Oren

source: Hours
cy: Oriau

source: Output hours and %
cy: Oriau a % allbwn

source: Paid Hours
cy: Oriau a delir

source: Hours worked
cy: Oriau a weithiwyd

source: Normal hours
cy: Oriau arferol

source: Kilowatt Hours
cy: Oriau Cilowat

source: Default hours worked
cy: Oriau diofyn a weithiwyd

source: Negative hours that will be subtracted from overtime hours first and than from normal hours
cy: Oriau negyddol bydd yn cael eu didynnu o'r oriau goramser yn gyntaf ac yna o'r oriau arferol

source: hours.
cy: oriau.

source: Preferred Hours/Week
cy: Oriau/Wythnos a Ffefrir

source: Watch
cy: Oriawr

source: Gallery
cy: Oriel

source: If you log out you will not receive reminders or notifications.
cy: Os byddwch yn allgofnodi ni fyddwch yn derbyn nodiadau atgoffa na hysbysiadau.

source: If you have a question that is not answered here,
cy: Os oes gennych gwestiwn nas atebir yma,

source: If you find this app useful - give it a rating!
cy: Os ydych chi'n cael yr ap yma'n ddefnyddiol - rhowch sgôr iddo!

source: If you like the app please rate it or leave a review!
cy: Os ydych chi'n hoffi'r ap, beth am ei sgorio neu adael adolygiad!

source: If you contact us by email, we will only use your address to answer your query.
cy: Os ydych yn cysylltu â ni ar e-bost, byddwn yn defnyddio'ch cyfeiriad i ateb eich ymholiad yn unig.

source: Avoid these
cy: Osgowch rhain

source: Ounces
cy: Owns

source: What topics are you interested in?
cy: Pa bynciau sydd o ddiddordeb i chi?

source: What type of transport did you use?
cy: Pa fath o drafnidiaeth ddefnyddioch chi?

source: How important is it that my devices are set to the same time?
cy: Pa mor bwysig yw hi fod fy nyfeisiau wedi'u gosod i'r un amser?

source: Expanded colour palette, better balanced with darker colours.
cy: Palet lliw estynedig, mwy cytbwys gyda lliwiau tywyllach.

source: Why can’t I record multiple simultaneous events?
cy: Pam dydw i ddim yn gallu cofnodi digwyddiadau lluosog ar yr un pryd?

source: Not really
cy: Pam lai

source: Why are my CSV files being garbled by Excel?
cy: Pam mae fy ffeiliau CSV yn cael eu cawlio gan Excel?

source: Why doesn't my second device see changes immediately?
cy: Pam nad yw fy ail ddyfais yn gweld newidiadau yn syth?

source: Why am I being told I am not logged into iCloud when I am?
cy: Pam ydw i'n cael neges yn dweud fy mod heb fewngofnodi i iCloud pan rydw i wedi?

source: Wallpaper
cy: Papur wal

source: Park
cy: Parc

source: Continue
cy: Parhau

source: Proceed
cy: Parhau

source: Continue with
cy: Parhau gyda

source: Continue with Twitter
cy: Parhau gyda Twitter

source: Continue without registration
cy: Parhau heb gofrestru

source: CONTINUE REVIEWING
cy: PARHAU I ADOLYGU

source: CONTINUE REVIEWING (%@)
cy: PARHAU I ADOLYGU (%@)

source: Keep using iCloud
cy: Parhau i ddefnyddio'r iCloud

source: CONTINUE LEARNING
cy: PARHAU I DDYSGU

source: Ongoing
cy: Parhaus

source: Keep growing your memories, come back at..
cy: Parhewch i dyfu eich atgofion, dewch yn ôl ar…

source: Stay tuned for live stream.
cy: Parhewch i wylio ar gyfer y ffrwd fyw.

source: Parsecs
cy: Parsecau

source: Mobile boarding pass
cy: Pas byrddio symudol

source: Passport
cy: Pasbort

source: Pascals
cy: Pascalau

source: Everyone
cy: Pawb

source: First Aid Kit
cy: Pecyn cymorth cyntaf

source: Peddler
cy: Pedler

source: Fourteen Days
cy: Pedwar diwrnod ar ddeg

source: Don't save
cy: Peidio â chadw

source: Don't Allow
cy: Peidio â chaniatáu

source: Don't Create
cy: Peidio â chreu

source: Don't show
cy: Peidio â dangos

source: Never Show
cy: Peidio â dangos byth

source: Don't use
cy: Peidio â defnyddio

source: Don't delete
cy: Peidio â dileu

source: Don't replace
cy: Peidio â disodli

source: Don't Replace
cy: Peidio â disodli

source: Don't recover
cy: Peidio ag adfer

source: Don't Send
cy: Peidio ag anfon

source: Don't
cy: Peidiwch

source: Don't show again
cy: Peidiwch â dangos eto

source: Don't Notify Me Between
cy: Peidiwch â fy hysbysu rhwng

source: Never ask me again
cy: Peidiwch â gofyn hyn byth eto

source: Don't group
cy: Peidiwch â grwpio

source: Don't worry, your subscription will be stored in the iCloud. It will be synced across all of your devices
cy: Peidiwch â phoeni, bydd eich tanysgrifiad ei storio yn yr iCloud. Bydd yn cysoni ar draws pob un o'ch dyfeisiau

source: No Worries!
cy: Peidiwch â phoeni!

source: Don’t break your “%@” streak!
cy: Peidiwch â thorri'ch streak "%@"!

source: Don't forget to get a tax refund
cy: Peidiwch ag anghofio cael ad-daliad treth

source: Don't forget to put in your time entries. Let's go!
cy: Peidiwch ag anghofio nodi'ch cofnodion amser. Bant â ni!

source: Don't forget to set up your account and start saving time today.
cy: Peidiwch ag anghofio sefydlu eich cyfrif a dechrau arbed amser heddiw.

source: Don't stay too long on this
cy: Peidiwch aros yn rhy hir ar hyn

source: DONT STAY TOO LONG ON THE RED BLOCKS
cy: PEIDIWCH AROS YN RHY HIR AR Y BLOCIAU COCH

source: Never miss the newest trends!
cy: Peidiwch byth â cholli'r ffasiynau diweddaraf!

source: Zoom Out
cy: Pellhau

source: Distance
cy: Pellter

source: Distance travelled
cy: Pellter a deithiwyd

source: Best distance
cy: Pellter gorau

source: Pen To Mixer
cy: Pen i'r cymysgydd

source: Pen
cy: Pen ysgrifennu

source: Birthday
cy: Pen-blwydd

source: Your birthday
cy: Pen-blwydd

source: Headings:
cy: Penawdau:

source: Native Village
cy: Pentref Brodorol

source: Farming Village
cy: Pentref Ffermio

source: Mining Village
cy: Pentref Glofaol

source: Fishing Village
cy: Pentref Pysgota

source: Hamlet
cy: Pentrefan

source: Weekends
cy: Penwythnosau

source: Weekends Only
cy: Penwythnosau yn unig

source: iCloud Performance
cy: Perfformiad iCloud

source: Live Performances
cy: Perfformiadau byw

source: Herbalist
cy: Perlysieuydd

source: People
cy: Person

source: person, place or thing
cy: person, lle neu beth

source: Custom
cy: Personol

source: Personal
cy: Personol

source: Customize your chat to look like the real deal.
cy: Personoli'ch sgwrs i edrych fel un go iawn.

source: Cutpurse
cy: Pigwr Pocedi

source: Pink
cy: Pinc

source: Hot pink
cy: Pinc llachar

source: Pin Your Favourites
cy: Piniwch eich ffefrynnau

source: Pinches
cy: Pinsiadau

source: Pinch to zoom
cy: Pinsiwch i nesáu/pellhau

source: Plant words in your memory then answer tests to grow them into flowers.
cy: Plannwch eiriau yn eich cof yna atebwch brofion er mwyn iddynt dyfu'n blodau.

source: Kids
cy: Plant

source: Platform
cy: Platfform

source: Platinum
cy: Platinwm

source: Infestations
cy: Plâu

source: Pearl Diver
cy: Plymiwr Perlau

source: Every %@ minutes
cy: Pob %@ munud

source: Every 2 Minutes
cy: Pob 2 funud

source: Every 30 Seconds
cy: Pob 30 eiliad

source: Every 5 Minutes
cy: Pob 5 munud

source: Each sentence
cy: Pob brawddeg

source: All Cards
cy: Pob Cerdyn

source: Each other player reveals cards from the top of his deck until revealing one costing 3 Coins or more.
cy: Pob chwaraewr arall yn datgelu cardiau o dop eu pecyn nes iddynt ddatgelu un sy'n costio 3 Darn Arian neu fwy.

source: Each other player reveals the top 2 cards of his deck.&#10;If they revealed any Treasure cards, they trash one of them that you choose.
cy: Pob chwaraewr arall yn datgelu'r 2 gerdyn ar dop eu pecyn.&#10;Os ydyn nhw'n datgelu unrhyw gardiau Trysor, rhaid iddyn nhw daflu un o'ch dewis chi.

source: Each other player discards the top card of his deck, then gains a Curse card, putting it on top of his deck.
cy: Pob chwaraewr arall yn taflu'r cerdyn ar dop eu pecyn, yna'n ennill cerdyn melltith, a'i roi ar dop eu pecyn.

source: Each word
cy: Pob gair

source: All Games
cy: Pob Gêm

source: All Locations
cy: Pob lleoliad

source: All Photos
cy: Pob Llun

source: Every Minute
cy: Pob Munud

source: All Alerts
cy: Pob Rhybudd

source: All Tasks
cy: Pob tasg

source: Any
cy: Pob un

source: All enquiries, please email:
cy: Pob ymholiad, e-bostiwch:

source: Other people
cy: Pobl eraill

source: People I follow
cy: Pobl rwyf yn eu dilyn

source: People you might know
cy: Pobl y gallech fod yn eu hadnabod

source: PEOPLE YOU MIGHT KNOW
cy: POBL Y GALLECH FOD YN EU HADNABOD

source: Popular
cy: Poblogaidd

source: Popular In
cy: Poblogaidd yn

source: Popular in %s
cy: Poblogaidd yn %s
